In [1]:
from sqlalchemy import create_engine
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv(r'C:\Users\VANT\ironhack\ejercicios\w3-project_SQL\data\language.csv')

data

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19
5            6    German  2006-02-15 05:02:19

In [3]:
nan_cols= data.isna().sum()

nan_cols

language_id    0
name           0
last_update    0
dtype: int64

In [4]:
data.drop_duplicates()

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19
5            6    German  2006-02-15 05:02:19

In [5]:
data['last_update'] = pd.to_datetime(data['last_update'])
data['last_date'] = data['last_update'].dt.floor('D')
data['last_update'] = pd.to_datetime(data['last_update'])

data['last_hour'] = data['last_update'].dt.time
data.drop(columns=['last_update'], inplace=True)

In [6]:
data

   language_id      name  last_date last_hour
0            1   English 2006-02-15  05:02:19
1            2   Italian 2006-02-15  05:02:19
2            3  Japanese 2006-02-15  05:02:19
3            4  Mandarin 2006-02-15  05:02:19
4            5    French 2006-02-15  05:02:19
5            6    German 2006-02-15  05:02:19

In [7]:
data.to_csv(r'C:\Users\VANT\ironhack\ejercicios\w3-project_SQL\language_clean.csv', index=False)